import './App.css';

function App() {
  return (
    <div className="App">
      {/* トップ画面 */}
      <main>
        <h1>エゴグラム診断</h1>
        <p>50問の質問であなたのパーソナリティを分析できます！</p>
        <button>START</button>
        <p>所要時間：5分</p>
      </main>
      {/* <p>------------------------------------------------</p> */}
      {/* 解説画面 */}
      {/* <div>
        <h1>「エゴグラム」とは？</h1>
        <p>パーソナリティの５つの側面を数値で表したものです。</p>
      </div> */}
      {/* <p>------------------------------------------------</p> */}
      {/* 質問画面 */}
      {/* <div>
        <div>
          <p>Q1.</p>
            <ul>
              <li>
                <input type="radio"></input>
                <p>はい</p>
              </li>
              <li>
                <input type="radio"></input>
                <p>いいえ</p>
              </li>
              <li>
                <input type="radio"></input>
                <p>どちらでもない</p>
              </li>
            </ul>
        </div>
      </div>
      <p>------------------------------------------------</p> */}
      {/* 結果画面 */}
      {/* <div>
        <div></div>
        <p>結果はこんなカンジです</p>
      </div>
      <p>------------------------------------------------</p> */}
    </div>
  );
}

export default App;
